7767517
156 188
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=16 1=4 11=4 12=1 13=4 14=0 2=1 3=4 4=0 5=1 6=768
Split                    splitncnn_0              1 2 1 2 3
Slice                    split_0                  1 2 2 4 5 -23300=2,4,12 1=0
Convolution              conv_1                   1 1 4 6 0=4 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=144
Concat                   cat_0                    2 1 6 5 7 0=0
Convolution              convrelu_0               1 1 7 8 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Convolution              conv_3                   1 1 8 9 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=512
BinaryOp                 add_0                    2 1 3 9 10 0=0
Convolution              conv_4                   1 1 10 11 0=24 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=1536
Split                    splitncnn_1              1 2 11 12 13
Slice                    split_1                  1 2 12 14 15 -23300=2,6,18 1=0
Convolution              conv_5                   1 1 14 16 0=6 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=324
Concat                   cat_1                    2 1 16 15 17 0=0
Convolution              convrelu_1               1 1 17 18 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Convolution              conv_7                   1 1 18 19 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1152
BinaryOp                 add_1                    2 1 13 19 20 0=0
Split                    splitncnn_2              1 2 20 21 22
Convolution              conv_8                   1 1 22 23 0=40 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=3840
Split                    splitncnn_3              1 2 23 24 25
Slice                    split_2                  1 2 24 26 27 -23300=2,10,30 1=0
Convolution              conv_9                   1 1 26 28 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=900
Concat                   cat_2                    2 1 28 27 29 0=0
Convolution              convrelu_2               1 1 29 30 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3200 9=1
Convolution              conv_11                  1 1 30 31 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=3200
BinaryOp                 add_2                    2 1 25 31 32 0=0
Split                    splitncnn_4              1 2 32 33 34
Slice                    split_3                  1 2 33 35 36 -23300=2,10,30 1=0
Convolution              conv_12                  1 1 35 37 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=900
Concat                   cat_3                    2 1 37 36 38 0=0
Convolution              convrelu_3               1 1 38 39 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3200 9=1
Convolution              conv_14                  1 1 39 40 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=3200
BinaryOp                 add_3                    2 1 34 40 41 0=0
Split                    splitncnn_5              1 2 41 42 43
Slice                    split_4                  1 2 42 44 45 -23300=2,10,30 1=0
Convolution              conv_15                  1 1 44 46 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=900
Concat                   cat_4                    2 1 46 45 47 0=0
Convolution              convrelu_4               1 1 47 48 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3200 9=1
Convolution              conv_17                  1 1 48 49 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=3200
BinaryOp                 add_4                    2 1 43 49 50 0=0
Split                    splitncnn_6              1 2 50 51 52
Convolution              conv_18                  1 1 52 53 0=80 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=12800
Split                    splitncnn_7              1 2 53 54 55
Slice                    split_5                  1 2 54 56 57 -23300=2,20,60 1=0
Convolution              conv_19                  1 1 56 58 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=3600
Concat                   cat_5                    2 1 58 57 59 0=0
Convolution              convrelu_5               1 1 59 60 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12800 9=1
Convolution              conv_21                  1 1 60 61 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=12800
BinaryOp                 add_5                    2 1 55 61 62 0=0
Convolution              conv_22                  1 1 62 63 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3200
Swish                    silu_69                  1 1 63 64
Split                    splitncnn_8              1 2 64 65 66
Pooling                  maxpool2d_60             1 1 66 67 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_9              1 2 67 68 69
Pooling                  maxpool2d_61             1 1 69 70 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_10             1 2 70 71 72
Pooling                  maxpool2d_62             1 1 72 73 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 65 68 71 73 74 0=0
Convolution              conv_23                  1 1 74 75 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12800
Swish                    silu_70                  1 1 75 76
Split                    splitncnn_11             1 2 76 77 78
Interp                   upsample_101             1 1 78 79 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 79 51 80 0=0
Convolution              conv_24                  1 1 80 81 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Swish                    silu_71                  1 1 81 82
Slice                    split_6                  1 2 82 83 84 -23300=2,64,64 1=0
Split                    splitncnn_12             1 2 84 85 86
Convolution              conv_25                  1 1 86 87 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_72                  1 1 87 88
Convolution              conv_26                  1 1 88 89 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_73                  1 1 89 90
Concat                   cat_8                    3 1 83 85 90 91 0=0
Convolution              conv_27                  1 1 91 92 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_74                  1 1 92 93
Split                    splitncnn_13             1 2 93 94 95
Interp                   upsample_102             1 1 95 96 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_9                    2 1 96 21 97 0=0
Convolution              conv_28                  1 1 97 98 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9728
Swish                    silu_75                  1 1 98 99
Slice                    split_7                  1 2 99 100 101 -23300=2,32,32 1=0
Split                    splitncnn_14             1 2 101 102 103
Convolution              conv_29                  1 1 103 104 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_76                  1 1 104 105
Convolution              conv_30                  1 1 105 106 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_77                  1 1 106 107
Concat                   cat_10                   3 1 100 102 107 108 0=0
Convolution              conv_31                  1 1 108 109 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_78                  1 1 109 110
Split                    splitncnn_15             1 3 110 111 112 113
Convolution              conv_32                  1 1 113 114 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_79                  1 1 114 115
Concat                   cat_11                   2 1 115 94 116 0=0
Convolution              conv_33                  1 1 116 117 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_80                  1 1 117 118
Slice                    split_8                  1 2 118 119 120 -23300=2,64,64 1=0
Split                    splitncnn_16             1 2 120 121 122
Convolution              conv_34                  1 1 122 123 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_81                  1 1 123 124
Convolution              conv_35                  1 1 124 125 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_82                  1 1 125 126
Concat                   cat_12                   3 1 119 121 126 127 0=0
Convolution              conv_36                  1 1 127 128 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_83                  1 1 128 129
Split                    splitncnn_17             1 3 129 130 131 132
Convolution              conv_37                  1 1 132 133 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_84                  1 1 133 134
Concat                   cat_13                   2 1 134 77 135 0=0
Convolution              conv_38                  1 1 135 136 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53248
Swish                    silu_85                  1 1 136 137
Slice                    split_9                  1 2 137 138 139 -23300=2,128,128 1=0
Split                    splitncnn_18             1 2 139 140 141
Convolution              conv_39                  1 1 141 142 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_86                  1 1 142 143
Convolution              conv_40                  1 1 143 144 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_87                  1 1 144 145
Concat                   cat_14                   3 1 138 140 145 146 0=0
Convolution              conv_41                  1 1 146 147 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_88                  1 1 147 148
Split                    splitncnn_19             1 2 148 149 150
Convolution              conv_42                  1 1 112 151 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_89                  1 1 151 152
Convolution              conv_43                  1 1 152 153 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_90                  1 1 153 154
Convolution              conv_44                  1 1 154 155 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_45                  1 1 111 156 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_91                  1 1 156 157
Convolution              conv_46                  1 1 157 158 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_92                  1 1 158 159
Convolution              conv_47                  1 1 159 160 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Concat                   cat_15                   2 1 155 160 161 0=0
Convolution              conv_48                  1 1 131 162 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_93                  1 1 162 163
Convolution              conv_49                  1 1 163 164 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_94                  1 1 164 165
Convolution              conv_50                  1 1 165 166 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_51                  1 1 130 167 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_95                  1 1 167 168
Convolution              conv_52                  1 1 168 169 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_96                  1 1 169 170
Convolution              conv_53                  1 1 170 171 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Concat                   cat_16                   2 1 166 171 172 0=0
Convolution              conv_54                  1 1 150 173 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_97                  1 1 173 174
Convolution              conv_55                  1 1 174 175 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_98                  1 1 175 176
Convolution              conv_56                  1 1 176 177 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_57                  1 1 149 178 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_99                  1 1 178 179
Convolution              conv_58                  1 1 179 180 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_100                 1 1 180 181
Convolution              conv_59                  1 1 181 182 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Concat                   cat_17                   2 1 177 182 183 0=0
Reshape                  view_103                 1 1 161 184 0=6400 1=69
Reshape                  view_104                 1 1 172 185 0=1600 1=69
Reshape                  view_105                 1 1 183 186 0=400 1=69
Concat                   cat_18                   3 1 184 185 186 out0 0=1
